<?php
	//操作类型
	function opType($i='')
	{
		$OpType=array(
		"a"=>"所有",
				"1"=>"添加",
				"2"=>"修改",
				"3"=>"删除",
				"4"=>"查看",
				"5"=>"登入",
				"6"=>"退出",
				"7"=>"同意",
				"8"=>"驳回",
				"9"=>"注销");
		if($i=='')
		{return $OpType;}
		else
		{return $OpType[$i];}
	}
	//操作项
	function opitem($i='')
	{
		$Op=array(
		"a"=>"所有",
				"0"=>"登陆系统",
				"1"=>"新建模板",
				"2"=>"用户管理",				
				"3"=>"资源管理",				
				"4"=>"待办事项",
				
			//	 ""=>"播放单元管理",
				 "102"=>"添加播放计划",
				 "103"=>"播放计划查看",
			//	 ""=>"Excel播放计划",
			//	 ""=>"终端管理",
				 "106"=>"终端分组",
				
				"200"=>"播放单元",
				"201"=>"创建播放单元",
				"202"=>"删除播放单元",
				//---> 终端控制
				"500"=>"终端控制"
		);
		if($i=='')
		{return $Op;}
		else
		{return $Op[$i];}
	}
	function areaItem($i)
	{
		$arrayItm=array(
				"501"=>"播放",
				"502"=>"暂停",
				"503"=>"停止",
				"504"=>"重启",
				"505"=>"停止插播",
				"506"=>"定时开关机",
				"507"=>"声音",
				"508"=>"插播profile",
				"509"=>"插播滚动字幕",
				"510"=>"插播LED字幕",
				"511"=>"更改播放计划",
				"512"=>"远程开机",
				"513"=>"旋转",
				"514"=>"终端升级",
				"515"=>"分辨率设置",
				"599"=>"定时开关机"
		);
		return $arrayItm[$i];
	}
	function clientLog($i='')
	{
		$logItem=array(
			"a"=>"所有",
			"0"=>"未知",
			"1"=>"下载成功",
			"2"=>"下载失败",
			"3"=>"磁盘信息",
			"4"=>"打开URL成功",
			"5"=>"打开URL失败",
			"6"=>"播放计划空",
			"7"=>"XAWTV失败",
			"8"=>"开始下载",
			"9"=>"播放失败",
			"10"=>"播放状态",
			"11"=>"开始播放",
			"12"=>"播放结束",
			"13"=>"下载消息",
			"14"=>"更新消息",
			"15"=>"终端上线",
			"16"=>"终端下线",
			"17"=>"停止播放",
			"18"=>"播放文件"
		);
		if($i=='')
		{return $logItem;}
		else
		{return $logItem[$i];}
	}
	function accessType($i)
	{
		$acc=array("1"=>"成功","0"=>"失败");
		return $acc[$i];
	}
	
	function errorInfoNum($i)
	{
		$errorInfo=array(
				"10000"=>"错误编号:",
				"10001"=>"错误信息:",
				//profile 创建
				"1000"=>"对不起您的提交的数据有误,无法格式化!",
				"1001"=>"您没有重命名文件系统目录的权限,请联系系统管理员!",
				"1002"=>"您没有创建文件系统目录的权限,请联系系统管理员!",
				"1003"=>"对不起,您输入的Profile名称已存在.请重新输入!",
				"1004"=>"对不起,您提交的区域信息数据格式有误.请重试!",
				"1005"=>"对不起,您的Profile的导出文件信息生成失败!",
				"1006"=>"profile 导出主区域预览文件生成出错!",
				"1007"=>"保存Profile信息到数据库时出错!",
				"1008"=>"Profile模板不存在,请选择正确的模板!",
				"1009"=>"写入Playlist表出错!",
				"1010"=>"对不起您当前的节目包生成失败!",
				"1011"=>"主区域文件插入失败",
				"1012"=>"图片区域文件插入失败",
				"1013"=>"flash区域文件插入失败",
				"1014"=>"滚动字幕区域文件插入失败",
				"1015"=>"网页模板Url区域文件插入失败",
				"1016"=>"背景音乐区域文件插入失败",
				"1017"=>"LED区域插入失败",
				"1018"=>"Profile描述写入失败",
				"1019"=>"Profile Tar包信息保存数据库失败",
				
				//--------------------------------------------
				"2000"=>"播放终端",
				"2001"=>"您查找的播放终端不存在",
				"2002"=>"您要修改的终端不存在"
		);
		return $errorInfo[$i];
	}
	function errorInfo($errNum)
	{
		return array("errorNumber"=>errorInfoNum(10000).$errNum,"errorInfo"=>errorInfoNum(10001).errorInfoNum($errNum));
	}
	function trueInfo($data,$table="")
	{
		return array("true",array("data"=>$data,"table"=>$table));
	}
	function okInfo($data)
	{
		return array("true",$data);
	}
	function falseInfo($errNum)
	{
		return array("false",errorInfo($errNum));
	}
?>
